[
  {
    "url": "https://www.linkedin.com/posts/renaldi_techstars-chicago-activity-7386491377351733248-9ctr",
    "content": "Techstars Chicago | John (JR) Renaldi ... If you're working on something new (or thinking about it), get your application in to Techstars Chicago Accelerator. The program's coming back after a few years hiatus, with my dear friend Logan LaHive returning as MD. I'm thrilled to be an alum, investor, and continued mentor of the program. The accelerator has produced some incredible companies - SpotHero, TradingView, LogicGate, and yes, my own Jiobit - as well as alumni across the broader Techstars network including PillPack (acquired by Amazon), SendGrid (acquired by Twilio), and DigitalOcean. I learned more through the program, and through the network I built coming out of it, than my previous 10 years combined. Life changing isn't an overstatement and one that you'll hear from other founders over and over. ... [47] 3 Comments"
  },
  {
    "url": "https://www.linkedin.com/posts/renaldi_gemini-deepmind-activity-7273345331109523456-ZdNn",
    "content": "#gemini #deepmind | John (JR) Renaldi ... Google's new Gemini 2.0 with real-time multimodal streaming is absolutely 🍌 's. With just a simple prompt, I could stream my phone's camera this AM and instantly comparison shop. Imagine a chest mount for your phone while Xmas shopping (glasses soon) and it could check every price on the shelf as you put things in your cart (without even asking as it would run in the background). Then tell me if it found it cheaper by 20%+ somewhere else. With a local encrypted datastore to have my passwords and credit cards, easy to see just having an agent buy it for me. I also prompted it to be a navigator and help me walk around my house as if I was blind. I did one pass of my first floor and it remembered all of it and told me how to walk around and where to avoid things as I walked.🤯 Feel free to give it a whirl @ https://lnkd.in/dDfFR3rY. It's free to play (for now)! Great job Google and Deep Mind teams! #gemini #deepmind ... [57] 7 Comments"
  },
  {
    "url": "https://www.linkedin.com/posts/renaldi_finally-pushed-an-llm-to-the-limits-and-it-activity-7402103980933521409-2PH1",
    "content": "Finally pushed an LLM to the limits and it went completely bonker ⚽⚽⚽ and developed a multiple personality disorder. 🤣 Note it also identified as a hacker. Really surprised there are no guardrails in place to stop runaways token outputs like this. Google DeepMind Gemini 3 Preview in the new Antigravity IDE started outputting this until it ran out of output tokens last night around 11:45pm CT due to I'm assuming extreme GPU load in their data center (LLMs known to go haywire under extreme memory and computational stress). What craziness have you witnessed? ... [54] 22 Comments"
  },
  {
    "url": "https://www.linkedin.com/posts/renaldi_this-is-a-great-program-for-any-life-activity-7270146980981465088-nlRV",
    "content": "👇👇 This is a great program for any life long learner. You can attend full time or fly in during the weekends for those not around Evanston. Extra bonus is you get to attend some of my classes! Hit me up if you'd like to learn more or better yet, attend this info session. ... [37] 0 Comments"
  },
  {
    "url": "https://www.linkedin.com/posts/renaldi_ive-yet-to-come-across-a-complete-reference-activity-7369355709731258369-IeSe",
    "content": "Free online guide to agent and agentic design concepts... I've yet to come across a complete reference guide that covers all the core technical aspects of agent and agentic design concepts together and in depth as this. It's not yet in print, but coming in December. Meanwhile, access the free online version in gdocs. If you're interested in this space and have a solid core technical understanding of LLMs and what a simple agent is, this is for you. I can vouch for this material as I teach most of it and have been building workshops over the past year with nearly identical content. This is your one stop shop. If you don't know how to code, it's alright, just skip past the examples and know all of these patterns can also be built in no code platforms too (Flowise, N8n, etc). The best up until now was AI Engineering by Chip Huyen (still a great reference), but this quickly shot up as the best I've seen and will be using it in our courses when it goes to print. ... [38] 2 Comments"
  },
  {
    "url": "https://www.linkedin.com/posts/renaldi_gemini-activity-7298960377155829760-QE1r",
    "content": "Building AI tools with Google #Gemini 2.0 at Northwestern University ... I've been consistently blown away by what I can build with Google #Gemini 2.0 that I just cannot get out of Anthropic and OpenAI. At Segal Design Institute at Northwestern University we are building AI tools to help coach students as they conduct customer interviews, perfecting their craft. After weeks of iterations tweaking these agents, giving them a variety of tools and deep research capabilities, Josh Campbell and I now see the quality of them on par with the feedback the faculty wrote, and sometimes, better 🤯. This means we can help students improve on every interview they complete, not just the one out of 20 that we might be able to watch and critique. And while we have a few tricks up our sleeve about how we did it, a big part is due to the balance of performance and accuracy with Gemini. It's just unmatched (although to be fair I've not compared to DeepSeek, mostly because Gemini APIs are still free!). A few quick observations from my builds... Full Docs, No BS Summaries * Bypass RAG for certain uses: RAG and summarization chains (even with contextual RAG) are like your data's playing a bad game of telephone. All the good stuff gets lost. * Gemini 2.0's Secret Weapon: Have your agent determine when to just throw the whole document in there. Manuals, white papers, research – the works. The results? Insanely detailed, accurate, and cited. You'll be floored. * Lightning Speed: And it's ridiculously fast. Like, way faster than messing with RAG and reranking. ⚡ NotebookLM Gets It (And You Should Too!) 🎯 * Ever wonder why NotebookLM is so powerful? It's doing exactly this – creating a massive content cache. Steal this strategy for your agents! * Other models I'm always wrestling with token limits. Gemini 2.0? Zero issues. Nada. No more summary of summaries that water down the context. Crazy Fast * Gemini 2.0 is fire. Like, 60-70% faster than other models when performing the same tasks. And it doesn't care about formatting. I've tried markdown and Xml. I've even optimized prompts specific to the model. I consistently see Gemini outperform. Orders of Magnitude Cost Savings * At $3 per million tokens, our Anthropic agents would have cost us about $.75 to run to do deep research + full analysis for each customer interview with the quality we needed. And note, we couldn't even get the quality there due to small context windows * And while I am on the free tier for now, the paid tier for Gemini is $0.10 per million tokens. Meaning each time we run these deep feedback agents, it costs us a couple cents. Disclaimer: * In my experience I do still prefer Anthropic Claude Sonnet 3.5 as an orchestrating agent. I find it's \"thinking\" outputs super helpful and it's ability to consistently call the right tools and sub agents to be the best. Although to be fair some of this may be how they are integrated with LangChain. ... [359] 39 Comments"
  },
  {
    "url": "https://www.linkedin.com/posts/jim-wicks_amplifying-the-great-work-john-jr-renaldi-activity-7299116970744913922-e1YH",
    "content": "Amplifying the great work John (JR) Renaldi and Josh Campbell are doing ... [50] 3 Comments"
  },
  {
    "url": "https://www.linkedin.com/posts/renaldi_a-vision-for-product-teams-silicon-valley-activity-7300286738420178944-MVth",
    "content": "How to upskill for gen ai-based product discovery ... A must read for any product person trying to think about how to upskill to be ready for the coming wave of innovation. One line stood out more than most, \"I believe that what will happen (again, in the 3-10 year timeframe) is that product discovery will become the main activity of product teams, and gen ai-based tools will automate most of the delivery.\" Invest in customer discovery, invest in building and hardening your experience and skills here, it's an art and science. ... [34] 4 Comments"
  },
  {
    "url": "https://www.linkedin.com/posts/renaldi_i-was-speaking-with-a-neighbor-about-a-similar-activity-7364468545415507970-XaAX",
    "content": "Why Build a Custom CRM for AI-Ready Data ... I was speaking with a neighbor about a similar thought to that from Klarna (but he's an architect). He doesn't have a CRM, but is thinking of building a lightweight, custom one. Why not just buy one off the shelf? Because his primary goal is to structure his firm's internal data to power future AI agents. He wants to own the data model from day one, preparing for a future where AI can intelligently leverage decades of project history, client notes, and material specs. His situation captures a huge shift. It's not just about saving on SaaS licenses anymore. The new question is: how do we prepare our core business data for an AI-native future? This brings up bigger questions. Is the era of monolithic SaaS ending? Is this just the natural progression that started with tools like Zapier and Retool, now accelerated by AI? Klarna’s well-publicized move away from platforms like Jira and Salesforce is another signal. While enterprise SaaS has its place, it's often overkill, and more importantly, it can lock away your data in a format you don't control. The Caveat: This isn't a pass for \"shadow IT.\" Success still requires professional engineering discipline. Think auth/RBAC, observability, backups, and security from day one. This talent is more accessible than ever, and if you have an in-house team, it's often a straightforward lift. For my architect neighbor, and for many clients, the build-vs-buy decision now has an AI-centric lens. Here's the framework we're using: • Data Ownership: Will building let us control our data model for future AI/RAG systems? • Core Differentiator: Does this workflow directly contribute to our competitive advantage? • 80/20 or Full Custom: Will standard features suffice, or do we need deep, bespoke functionality? • True TCO: Compare licenses + admin overhead vs. the cost of a small, dedicated internal app. • Agility: Can we iterate on our own timeline as our AI strategy evolves? The best way to start is small. Target one high-friction workflow and prove the value. Here's also a post from Marty Cagan on this same topic for additional thoughts: https://lnkd.in/g9RV-uzX ... [9] 1 Comment"
  }
]